Autodesk.Revit.DB.WorksharingUtils.IsUpToDate(Autodesk.Revit.DB.ModelPath,System.Int32,System.Guid,System.Guid)
Check whether a local cache is up to date with its central model.
Remarks:
This API only works for cloud-based models.
modelPath:
Model path of the central model
latestCentralVersionInLocal:
Latest central version in the local model.
latestCentralEpisodeGUIDInLocal:
Latest central episodeGUID in the local model.
clientModelID:
ID of the local model
Returns:
true if the local cache is up to date with its central model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is being accessed by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2018

Autodesk.Revit.DB.WorksharingUtils.IsUpToDate(System.Guid,System.Guid,System.Int32,System.Guid,System.Guid)
Check whether a local cache is up to date with its central model.
Remarks:
This API only works for cloud-based models.
projectID:
project ID of the central model.
modelID:
ID of the central model.
latestCentralVersionInLocal:
latest central version in the local model.
latestCentralEpisodeGUIDInLocal:
latest central episodeGUID in the local model.
clientModelID:
ID of the local model
Returns:
true if the local cache is up to date with its central model.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is being accessed by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2015

Autodesk.Revit.DB.WorksharingUtils.LogWorksharingTime(System.Guid,System.Guid,System.Guid,System.String,System.Double)
Log the time taken by a given worksharing operation into the server logs.
projectID:
GUID of the project
modelID:
GUID of the project
clientModelID:
GUID of the project
operation:
String identifying the operation to be timed
time:
Measured time taken for the operation
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WorksharingUtils.GetWorksharingTooltipInfo(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets worksharing information about an element to display in an in-canvas tooltip.
Remarks:
If there is no element corresponding to the given id,
then all the strings returned in WorksharingTooltipInfo are empty.
The return value may not be dependable in the middle of a transaction.
See the remarks on Autodesk.Revit.DB.WorksharingUtils for more details.
document:
The document containing the element
elementId:
The id of the element in question
Returns:
Worksharing information about the specified element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WorksharingUtils.CreateNewLocal(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.ModelPath)
Takes a path to a central model and copies the model into a new local file for the current user.
sourcePath:
The path to the central model.
targetPath:
The path to put the new local file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given path sourcePath is a cloud path which is not supported in this method.
-or-
The model is not workshared.
-or-
The central model has not fully enabled worksharing.
It must be opened and resaved to finish enabling worksharing.
-or-
The model is a local file.
-or-
The central model is not saved in the current Revit version.
-or-
The model is transmitted.
-or-
-or-
The specified filepath is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another user.
-or-
The central model is being accessed by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException:
The file or folder already exists and cannot be overwritten.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This functionality is not available in Revit LT.
-or-
File already exists!
-or-
Revit Server does not support local models.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2014

Autodesk.Revit.DB.WorksharingUtils.GetUserWorksetInfo(Autodesk.Revit.DB.ModelPath)
Gets information about user worksets in a workshared model file, without fully opening the file.
Remarks:
This method provides a preview of the user worksets available in a file, allowing an
application to look up the necessary workset ids and information to properly fill out a WorksetConfiguration
structure before opening or linking to this model.
path:
The path to the workshared model.
Returns:
Information about all the user worksets in the model.
The list is sorted by workset id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given path path is a cloud path which is not supported in this method.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model are locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is missing.
-or-
The central model is corrupt or not an RVT file.
-or-
The model is not workshared.
-or-
The central model is overwritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model could not be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The Revit model specified by path doesn't exist.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The model could not be found at the specified path.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This functionality is not available in Revit LT.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2012

Autodesk.Revit.DB.WorksharingUtils.RelinquishOwnership(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.RelinquishOptions,Autodesk.Revit.DB.TransactWithCentralOptions)
Relinquishes ownership by the current user of as many specified elements and worksets as possible,
and grants element ownership requested by other users on a first-come, first-served basis.
Remarks:
Elements and worksets owned by other users are ignored.
Only unmodified elements already in central will be relinquished by this method.
Newly added and modified elements cannot be relinquished
until they have been synchronized with central.
For best performance, relinquish items in one big call, rather than many small calls.
document:
The document containing the elements and worksets.
generalCategories:
General categories of items to relinquish.  See RelinquishOptions for details.
options:
Options to customize access to the central model.
null is allowed and means no customization.
Returns:
The elements and worksets that were relinquished.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a workshared document.
-or-
document is not a primary document, it is a linked document.
-or-
document is read-only: It cannot be modified.
-or-
document has an open editing transaction and is accepting changes.
-or-
Saving is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached,
e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is overwritten by other user.
-or-
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2014

Autodesk.Revit.DB.WorksharingUtils.CheckoutWorksets(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.WorksetId},Autodesk.Revit.DB.TransactWithCentralOptions)
Obtains ownership for the current user of as many specified worksets as possible.
Remarks:
For best performance, check out all worksets in one big call, rather than many small calls.
document:
The document containing the worksets.
worksetsToCheckout:
The ids of the worksets to attempt to check out.
options:
Options to customize access to the central model.
null is allowed and means no customization.
Returns:
The ids of all specified worksets that are now owned,
including all that were owned prior to the function call.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a workshared document.
-or-
document is not a primary document, it is a linked document.
-or-
document is read-only: It cannot be modified.
-or-
document has an open editing transaction and is accepting changes.
-or-
There are one or more ids with no corresponding workset.
-or-
Saving is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached,
e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model are locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is overwritten by other user.
-or-
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2015

Autodesk.Revit.DB.WorksharingUtils.CheckoutWorksets(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.WorksetId})
Obtains ownership for the current user of as many specified worksets as possible.
Remarks:
For best performance, check out all worksets in one big call, rather than many small calls.
When there comes a contention error when locking the central model, this API would wait and retry
endlessly until getting the lock of the central model.
document:
The document containing the worksets.
worksetsToCheckout:
The ids of the worksets to attempt to check out.
Returns:
The ids of all specified worksets that are now owned,
including all that were owned prior to the function call.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a workshared document.
-or-
document is not a primary document, it is a linked document.
-or-
document is read-only: It cannot be modified.
-or-
document has an open editing transaction and is accepting changes.
-or-
There are one or more ids with no corresponding workset.
-or-
Saving is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached,
e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model are locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is overwritten by other user.
-or-
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2014

Autodesk.Revit.DB.WorksharingUtils.CheckoutElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.TransactWithCentralOptions)
Obtains ownership for the current user of as many specified elements as possible.
Remarks:
For best performance, checkout all elements in one big call, rather than many small calls.
Revit may check out additional elements that are needed to check out the elements you requested.
For example, if you request an element that is in a group, Revit will check out the entire group.
document:
The document containing the elements.
elementsToCheckout:
The ids of the elements to attempt to check out.
options:
Options to customize access to the central model.
null is allowed and means no customization.
Returns:
The ids of all specified elements that are now owned (but possibly out of date),
including all that were owned prior to the function call.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a workshared document.
-or-
document is not a primary document, it is a linked document.
-or-
One or more elements in elementsToCheckout do not exist in the document.
-or-
Saving is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
Editing permissions for the file-based central model could not be accessed for write,
e.g. the network is down, central is missing, or central is read-only.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
Editing permissions for the central model are locked and the last attempt to lock was canceled.
-or-
The central model is being accessed by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
An error has occurred while checking out worksets or elements.
-or-
The central model is overwritten by other user.
-or-
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2015

Autodesk.Revit.DB.WorksharingUtils.CheckoutElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Obtains ownership for the current user of as many specified elements as possible.
Remarks:
For best performance, checkout all elements in one big call, rather than many small calls.
Revit may check out additional elements that are needed to check out the elements you requested.
For example, if you request an element that is in a group, Revit will check out the entire group.
When there comes a contention error when locking the central model, this API would wait and retry
endlessly until getting the lock of the central model.
document:
The document containing the elements.
elementsToCheckout:
The ids of the elements to attempt to check out.
Returns:
The ids of all specified elements that are now owned (but possibly out of date),
including all that were owned prior to the function call.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a workshared document.
-or-
document is not a primary document, it is a linked document.
-or-
One or more elements in elementsToCheckout do not exist in the document.
-or-
Saving is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
Editing permissions for the file-based central model could not be accessed for write,
e.g. the network is down, central is missing, or central is read-only.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
Editing permissions for the central model are locked and the last attempt to lock was canceled.
-or-
The central model is being accessed by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
An error has occurred while checking out worksets or elements.
-or-
The central model is overwritten by other user.
-or-
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2014

Autodesk.Revit.DB.WorksharingUtils.GetCheckoutStatus(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the ownership status of an element.
Remarks:
This method returns a locally cached value which may not be up to date with the current state
of the element in the central.  Because of this, the return value is suitable for reporting to an
interactive user (e.g. via a mechanism similar to Worksharing display mode), but cannot be considered
a reliable indication of whether the element can be immediately edited by the application.  Also, the return value
may not be dependable in the middle of a local transaction.  See the remarks
on Autodesk.Revit.DB.WorksharingUtils for more details.
For performance reasons, the model is not validated to be workshared,
and the element id is also not validated; the element will not be expanded.
document:
The document containing the element.
elementId:
The id of the element.
Returns:
A summary of whether the element is unowned, owned by the current user, or owned by another user.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WorksharingUtils.GetCheckoutStatus(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String@)
Gets the ownership status and outputs the owner of an element.
Remarks:
This method returns a locally cached value which may not be up to date with the current state
of the element in the central.  Because of this, the return value is suitable for reporting to an
interactive user (e.g. via a mechanism similar to Worksharing display mode), but cannot be considered
a reliable indication of whether the element can be immediately edited by the application.  Also, the return value
may not be dependable in the middle of a local transaction.  See the remarks
on Autodesk.Revit.DB.WorksharingUtils for more details.
For performance reasons, the model is not validated to be workshared,
and the element id is also not validated; the element will not be expanded.
document:
The document containing the element.
elementId:
The id of the element.
owner:
The owner of the element, or an empty string if no one owns it.
Returns:
An indication of whether the element is unowned, owned by the current user, or owned by another user.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WorksharingUtils.GetModelUpdatesStatus(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the status of a single element in the central model.
Remarks:
This method returns a locally cached value which may not be up to date with the current state
of the element in the central.  Because of this, the return value is suitable for reporting to an
interactive user (e.g. via a mechanism similar to Worksharing display mode), but cannot be considered
a reliable indication of whether the element can be immediately edited by the application.  Also, the return value
may not be dependable in the middle of a local transaction.  See the remarks
on Autodesk.Revit.DB.WorksharingUtils for more details.
For performance reasons, the model is not validated to be workshared,
and the element id is also not validated; the element will not be expanded.
document:
The document containing the element.
elementId:
The id of the element.
Returns:
The status of the element in the local session versus the central model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WorksharingUtils.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.WorksharingUtils
A static class that contains utility functions related to worksharing.
Remarks:
Return values from inquiries about the worksharing status of elements or worksets
rely on local caching of information from the central model so it is possible that the
information is out of date. Because of this, the return value is suitable for reporting to an
interactive user (e.g. via a mechanism similar to Worksharing display mode), but cannot be considered
a reliable indication of whether the element can be immediately edited by the application.  To make an immediate
attempt to edit elements, use CheckoutElements() and check the return status,
then confirm if the elements are up to date.
In addition, information about the current user may not be
reliable while Revit is in the middle of an editing transaction.  For example,
if you move an unowned wall from an unowned workset to a workset you own,
then before you explicitly or Revit automatically checks out the wall for you,
GetCheckoutStatus() might erroneously tell you CheckoutStatus.OwnedByCurrentUser
because although the official (as seen in central and by other users) owner is no one,
locally it looks like you already own it since it belongs to a workset you own.
For operations that interact with central (as opposed to use only cached values),
Revit might opportunistically refresh some editing permissions or check the status of editing requests.
Some useful definitions to keep in mind follow:
The owner of a workset: the user who has the Workset checked out; this could be nobody (the empty string).  The borrower of an element: the user who has explicitly checked out ("borrowed") the Element;
this could be nobody.  The owner of an element: If element is borrowed (i.e. explicitly checked out),
then the element's owner is the borrower, otherwise it is the owner or the workset containing the element.
Since:
2012